# 900元套餐 每個人各出300元
# 大雄 300元
# 胖虎 300元
# 小夫 300元

#特價750
#應找150 分給三人 150元/3人 = 一人50元

#服務生私吞 一人只給30元 共私吞 (50-30)*3=60  150-90 = 60
#原先現金為900
# (300-30)*3 = 810 此為套餐價值
# 所以只找回90元

# 本來應該是
# 一開始付出的現金 = 套餐       + 原先應該找零
# 900            =  250*3       + 150

# 暗槓的情況
# 一開始付出的現金 = 套餐暗槓價 + 暗槓後只找零
# 900             =  270*3       + 90---A

#暗槓零錢的計算應該是
# 原先應該找零 - 暗槓後只找零 = 暗槓的零錢
# 150         -       90    = 60   

# 私吞的部分是在找零的時候產生 
# 不應跟原先計算混淆



#如以原先解釋 
#套餐270 *3 =810
#服務生暗槓 = 60
#套餐價格 + 暗槓的零錢 = ?
#810 +60 = 870 

#暗槓後只找零 - 暗槓的零錢 
# 90(A)-60 = 30  --差額產生
#邏輯就不對了

#正確應該是
# 暗槓的情況
# 一開始付出的現金 = 套餐暗槓價 + 暗槓後只找零(單純加入找零錢)
# 900             =  270*3   + 90---A

# 或

# 一開始付出的現金 = 套餐   + 找出零錢 + 暗槓零錢
# 900            =  750   + 90      + 60
